WELCOME_MESSAGE = (
    "✨ Привет, я Маша!\n"
    "Я эксперт по нейрографике и знаю, как через специальные алгоритмы и метафорические карты "
    "помочь тебе увидеть скрытые решения и получить инсайт.\n\n"
    "Что это даёт?\n"
    "🖊 Помогает взглянуть на ситуацию под другим углом\n"
    "🔮 Достаёт из подсознания ключевые послания и ответы\n"
    "⚡ Даёт ясность, уверенность и энергию для действий\n\n"
    "💡 Давай начнём! Чтобы я могла лучше помочь тебе, нужно немного информации.\n"
    "📌 Нажми на кнопку ниже и отправь свой номер телефона:"
)

MAIN_MENU_TEXT = (
    "✨ Спасибо, {name}! Теперь всё готово! Давай посмотрим, что подскажет тебе твоя карта сегодня или попробуем освоить нейрографику.\n\n"
    "🔹 Выбери, что хочешь сделать:\n"
    "🔮 Вытянуть метафорическую карту – получи ответ от подсознания прямо сейчас\n"
    "🎓 Записаться на сессию по нейрографике – открой для себя метод, который меняет мышление"
)

CARD_INSTRUCTION_TEXT = (
    "🔮 Метафорические карты – это способ получить ответ от подсознания.\n"
    "Каждая карта несёт послание, которое поможет тебе взглянуть на ситуацию с новой точки зрения.\n"
    "💡 Готов узнать, что тебе подскажет твоя карта?\n"
    "Перейди в закрытый канал с карточками по ссылке:\n"
    "https://t.me/+Io5-yW5dgyEyNjhi\n"
    "Выбери карту, запомни её номер и вернись сюда, чтобы ввести номер карты."
)
